<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>

<%
/*
			
	정적 웹 페이지란 웹 서버에 저장되어 있는 파일 그대로 웹 브라우저에 전송해 출력하는 가장 기본적인
	웹 페이지를 말한다. 클라이언트가 어떤 형태로 요청하더라도 같은 페이지는 항상 동일한 모습을 보여주기 때문에
	"정적"이라는 수식어가 붙습니다.
	
	반면 동적 웹페이지란 동일한 페이지라 할지라도 그때그때 내용이 달라질수 있는 웹 페이지를 말한다.
	달리 표현하면 서버가 클라이언트의 요청을 해석하여 가장 적절한 웹 페이지를 그때그때 생성해주는 기술입니다.
	따라서 클라이언트는 요청한 계정, 시간, 지역, 언어, 기타 입력값에 따라 다른 결과를 받습니다.
	
	(그림은 책을 참조 page59)
	그림에서 보듯 동적 웹 페이지는 '전처리' 과정을 거쳐 응답 페이지를 동적으로 생성합니다. 그리고
	이 전처리를 어떻게 처리하느냐에 따라 구체적인 동적 웹 페이지 기술이 나뉩니다. 대표적으로는
	JSP와 서블릿이 있고, 다른 기술로는 ASP와 PHP 등이 있다.

*/
%>

</body>
</html>